In [5]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series()
print(s)

Series([], dtype: float64)

In [7]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [9]:
d = np.array(['w','sd','f','sf','sww','ee'])
d

array(['w', 'sd', 'f', 'sf', 'sww', 'ee'], dtype='<U3')

In [10]:
sd = pd.Series(d)
sd

0      w
1     sd
2      f
3     sf
4    sww
5     ee
dtype: object

In [12]:
sid = pd.Series(d,index=[4,5,7,8,2,6])
sid

4      w
5     sd
7      f
8     sf
2    sww
6     ee
dtype: object

In [13]:
l = {'a':41,'b':2,'c':4,'d':7}
l

{'a': 41, 'b': 2, 'c': 4, 'd': 7}

In [19]:
ls = pd.Series(l)
ls

a    41
b     2
c     4
d     7
dtype: int64

In [16]:
i = pd.Series(5,index=[4,7,8,5,9])
i

4    5
7    5
8    5
5    5
9    5
dtype: int64

In [24]:
i[:7]

4    5
7    5
8    5
5    5
9    5
dtype: int64

In [23]:
ls['c']

4

In [26]:
sd[:4]

0     w
1    sd
2     f
3    sf
dtype: object

In [28]:
sd[[4,5]]

4    sww
5     ee
dtype: object

In [31]:
data = [1,2,3,4,5]
data

[1, 2, 3, 4, 5]

In [32]:
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [33]:
data1=[['1','hj','gh'],['2','hj','gh'],['3','hj','gh']]
data1

[['1', 'hj', 'gh'], ['2', 'hj', 'gh'], ['3', 'hj', 'gh']]

In [34]:
df1 = pd.DataFrame(data1)

In [35]:
df1

   0   1   2
0  1  hj  gh
1  2  hj  gh
2  3  hj  gh

In [37]:
data2={'Name':['yfj','hj','gh'],'age':['2','4','7'],'fname':['ty','hj','gh']}
data2

{'Name': ['yfj', 'hj', 'gh'],
 'age': ['2', '4', '7'],
 'fname': ['ty', 'hj', 'gh']}

In [38]:
df2=pd.DataFrame(data2)
df2

  Name age fname
0  yfj   2    ty
1   hj   4    hj
2   gh   7    gh

In [40]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

d

{'one': a    1
 b    2
 c    3
 dtype: int64, 'two': a    1
 b    2
 c    3
 d    4
 dtype: int64}

In [41]:
df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [42]:
d = {'one' : pd.Series([1, 2, 3]),
      'two' : pd.Series([1, 2, 3, 4])}

d

{'one': 0    1
 1    2
 2    3
 dtype: int64, 'two': 0    1
 1    2
 2    3
 3    4
 dtype: int64}

In [45]:
dtd = pd.DataFrame(d)
dtd

   one  two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4

In [46]:
dtd['c'] = pd.Series([4.7,68,5])
dtd

   one  two     c
0  1.0    1   4.7
1  2.0    2  68.0
2  3.0    3   5.0
3  NaN    4   NaN

In [47]:
dtd[2:4]

   one  two    c
2  3.0    3  5.0
3  NaN    4  NaN

In [48]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [49]:
dtd = dtd.append(df)

/usr/local/lib/python3.6/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [51]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [52]:
# creating an empty panel
data = np.random.rand(2,4,5)
p = pd.Panel(data)
p

/usr/local/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3267: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 5 (minor_axis)
Items axis: 0 to 1
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 4

In [53]:
df.sum()

a    16
b    20
dtype: int64

In [54]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}
d

{'Name': 0        Tom
 1      James
 2      Ricky
 3        Vin
 4      Steve
 5      Smith
 6       Jack
 7        Lee
 8      David
 9     Gasper
 10    Betina
 11    Andres
 dtype: object, 'Age': 0     25
 1     26
 2     25
 3     23
 4     30
 5     29
 6     23
 7     34
 8     40
 9     30
 10    51
 11    46
 dtype: int64, 'Rating': 0     4.23
 1     3.24
 2     3.98
 3     2.56
 4     3.20
 5     4.60
 6     3.80
 7     3.78
 8     2.98
 9     4.80
 10    4.10
 11    3.65
 dtype: float64}

In [56]:
#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [57]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [58]:
df. describe(include='all')

         Name        Age     Rating
count      12  12.000000  12.000000
unique     12        NaN        NaN
top     Steve        NaN        NaN
freq        1        NaN        NaN
mean      NaN  31.833333   3.743333
std       NaN   9.232682   0.661628
min       NaN  23.000000   2.560000
25%       NaN  25.000000   3.230000
50%       NaN  29.500000   3.790000
75%       NaN  35.500000   4.132500
max       NaN  51.000000   4.800000

In [59]:
a =5
b =4
def adder(a,b):
return a+b

IndentationError: expected an indented block (<ipython-input-59-a376a7c87ae5>, line 4)

In [63]:
def adder(ele1,ele2):
   return ele1+ele2

df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df.pipe(adder,2)
a= df.apply(np.mean)
a

col1   -0.438444
col2    0.511474
col3    0.835089
dtype: float64

In [64]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  0.985542  0.726812  0.996887
1  0.109904  1.529734 -1.334804
2  0.222274 -0.945918  1.121811
3  0.574503  0.839771  0.391986
4 -0.569051 -1.279764 -0.503985

In [68]:
for key,value in df.iteritems():
    print(key,value)

col1 0    0.985542
1    0.109904
2    0.222274
3    0.574503
4   -0.569051
Name: col1, dtype: float64
col2 0    0.726812
1    1.529734
2   -0.945918
3    0.839771
4   -1.279764
Name: col2, dtype: float64
col3 0    0.996887
1   -1.334804
2    1.121811
3    0.391986
4   -0.503985
Name: col3, dtype: float64

In [70]:
for key,v in df.iterrows():
    print(key,v)

0 col1    0.985542
col2    0.726812
col3    0.996887
Name: 0, dtype: float64
1 col1    0.109904
col2    1.529734
col3   -1.334804
Name: 1, dtype: float64
2 col1    0.222274
col2   -0.945918
col3    1.121811
Name: 2, dtype: float64
3 col1    0.574503
col2    0.839771
col3    0.391986
Name: 3, dtype: float64
4 col1   -0.569051
col2   -1.279764
col3   -0.503985
Name: 4, dtype: float64

In [71]:
df

       col1      col2      col3
0  0.985542  0.726812  0.996887
1  0.109904  1.529734 -1.334804
2  0.222274 -0.945918  1.121811
3  0.574503  0.839771  0.391986
4 -0.569051 -1.279764 -0.503985

In [72]:
for r in df.itertuples():
    print(r)

Pandas(Index=0, col1=0.9855421960147587, col2=0.7268116866805245, col3=0.9968869798181599)
Pandas(Index=1, col1=0.10990377135665973, col2=1.5297343797055023, col3=-1.3348044088055369)
Pandas(Index=2, col1=0.22227424831635859, col2=-0.945917796384518, col3=1.1218107913349058)
Pandas(Index=3, col1=0.5745033554637092, col2=0.8397710662518733, col3=0.3919863060992997)
Pandas(Index=4, col1=-0.5690514649399183, col2=-1.2797643743562297, col3=-0.5039845456385355)

In [73]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

# Select all rows for multiple columns, say list[]
print(df.loc[:,['A','C']])

          A         C
a -0.961639  1.320684
b  0.848799 -0.257494
c  0.456366  0.176749
d  0.299940 -1.059347
e -0.333972  0.081550
f -1.052902 -0.722694
g -0.975885 -0.722339
h -0.376485  0.688077

In [75]:
print(df.loc[['a','b','f','h'],['A','C','B']])

          A         C         B
a -0.961639  1.320684 -0.992311
b  0.848799 -0.257494  0.719204
f -1.052902 -0.722694  0.156754
h -0.376485  0.688077  2.967127

In [78]:
print(df.iloc[1:5, 2:3])

          C
b -0.257494
c  0.176749
d -1.059347
e  0.081550

In [79]:
df

          A         B         C         D
a -0.961639 -0.992311  1.320684  1.251221
b  0.848799  0.719204 -0.257494  1.722087
c  0.456366  0.536598  0.176749  1.540475
d  0.299940 -1.292322 -1.059347  1.713846
e -0.333972  1.338102  0.081550  1.658486
f -1.052902  0.156754 -0.722694  0.507190
g -0.975885 -0.306417 -0.722339 -0.177031
h -0.376485  2.967127  0.688077  0.191360

In [80]:
# Slicing through list of values
print(df.iloc[[1, 3, 5], [1, 3]])
print (df.iloc[1:3, :])
print (df.iloc[:,1:3])

          B         D
b  0.719204  1.722087
d -1.292322  1.713846
f  0.156754  0.507190
          A         B         C         D
b  0.848799  0.719204 -0.257494  1.722087
c  0.456366  0.536598  0.176749  1.540475
          B         C
a -0.992311  1.320684
b  0.719204 -0.257494
c  0.536598  0.176749
d -1.292322 -1.059347
e  1.338102  0.081550
f  0.156754 -0.722694
g -0.306417 -0.722339
h  2.967127  0.688077

In [81]:
print (df.loc[:,'A'])

a   -0.961639
b    0.848799
c    0.456366
d    0.299940
e   -0.333972
f   -1.052902
g   -0.975885
h   -0.376485
Name: A, dtype: float64

In [82]:
# Integer slicing
print (df.ix[:4])

          A         B         C         D
a -0.961639 -0.992311  1.320684  1.251221
b  0.848799  0.719204 -0.257494  1.722087
c  0.456366  0.536598  0.176749  1.540475
d  0.299940 -1.292322 -1.059347  1.713846

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [83]:
s = pd.Series([1,2,3,4,5,4])
s.pct_change()

0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64

In [84]:
df = pd.DataFrame(np.random.randn(5, 2))
df.pct_change()

          0         1
0       NaN       NaN
1 -1.199834 -4.463413
2  5.663696 -1.669896
3 -3.070981 -1.660200
4 -1.477712 -5.000079

In [85]:
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
s1.cov(s2)

0.4171717202738516

In [86]:
df = pd.DataFrame(np.random.randn(10, 4),
index = pd.date_range('1/1/2000', periods=10),
columns = ['A', 'B', 'C', 'D'])
df.rolling(window=3).mean()

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03  0.438915  0.215691 -0.081151  0.291250
2000-01-04  0.226217  0.170670 -0.346051 -0.173533
2000-01-05  0.030793  0.472390 -0.537794 -1.004692
2000-01-06  0.978169  0.640550  0.063398 -0.848689
2000-01-07  0.577742  0.408391 -0.024367  0.157157
2000-01-08  0.227274  0.309489 -0.088844  1.419498
2000-01-09 -1.142373 -0.701222 -1.057452  1.327242
2000-01-10 -0.222463 -0.503183 -0.381610  1.262528

In [87]:
df = pd.DataFrame(np.random.randn(10, 4),
      index = pd.date_range('1/1/2000', periods=10),
      columns = ['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01  1.148525 -2.087561  0.291468 -0.948585
2000-01-02  1.189207  0.118073 -0.555738  0.626822
2000-01-03 -1.256683  0.227681 -1.306578  1.191143
2000-01-04 -0.808593  0.478820 -0.297759 -0.502776
2000-01-05 -0.350932 -0.683468 -0.065296  0.589716
2000-01-06 -0.552891  1.475932  1.093712 -0.494595
2000-01-07 -0.838985 -1.385549  0.601191 -0.855997
2000-01-08  1.803366  0.033078  1.071807 -0.369363
2000-01-09 -0.700429  0.100967 -0.253747 -1.475107
2000-01-10  1.879968 -0.351483 -1.442475 -0.977913

In [88]:
r = df.rolling(window=3,min_periods=1)
r

Rolling [window=3,min_periods=1,center=False,axis=0]

In [89]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])
df

        one       two     three
a -0.301848 -0.980870  1.136932
c  0.180950 -0.689600  1.932787
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
h  0.013985 -0.474336  1.603870

In [90]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h','i'])

In [91]:
df

        one       two     three
a -0.301848 -0.980870  1.136932
b       NaN       NaN       NaN
c  0.180950 -0.689600  1.932787
d       NaN       NaN       NaN
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
g       NaN       NaN       NaN
h  0.013985 -0.474336  1.603870
i       NaN       NaN       NaN

In [92]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
i     True
Name: one, dtype: bool

In [94]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
i    False
Name: one, dtype: bool

In [95]:
df.sum()

one      0.687134
two     -1.389027
three    3.168871
dtype: float64

In [96]:
empty = pd.DataFrame(index=[0,1,2,3,4,5],columns=['one','two'])
empty

   one  two
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN
5  NaN  NaN

In [97]:
empty.sum()

one    0.0
two    0.0
dtype: float64

In [98]:
df.fillna(0)

        one       two     three
a -0.301848 -0.980870  1.136932
b  0.000000  0.000000  0.000000
c  0.180950 -0.689600  1.932787
d  0.000000  0.000000  0.000000
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
g  0.000000  0.000000  0.000000
h  0.013985 -0.474336  1.603870
i  0.000000  0.000000  0.000000

In [99]:
df.fillna(1)

        one       two     three
a -0.301848 -0.980870  1.136932
b  1.000000  1.000000  1.000000
c  0.180950 -0.689600  1.932787
d  1.000000  1.000000  1.000000
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
g  1.000000  1.000000  1.000000
h  0.013985 -0.474336  1.603870
i  1.000000  1.000000  1.000000

In [100]:
df.fillna(method='pad')

        one       two     three
a -0.301848 -0.980870  1.136932
b -0.301848 -0.980870  1.136932
c  0.180950 -0.689600  1.932787
d  0.180950 -0.689600  1.932787
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
g -0.107288  0.248222 -0.867108
h  0.013985 -0.474336  1.603870
i  0.013985 -0.474336  1.603870

In [101]:
df.fillna(method='backfill')

        one       two     three
a -0.301848 -0.980870  1.136932
b  0.180950 -0.689600  1.932787
c  0.180950 -0.689600  1.932787
d  0.901335  0.507557 -0.637609
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
g  0.013985 -0.474336  1.603870
h  0.013985 -0.474336  1.603870
i       NaN       NaN       NaN

In [102]:
df

        one       two     three
a -0.301848 -0.980870  1.136932
b       NaN       NaN       NaN
c  0.180950 -0.689600  1.932787
d       NaN       NaN       NaN
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
g       NaN       NaN       NaN
h  0.013985 -0.474336  1.603870
i       NaN       NaN       NaN

In [103]:
df.dropna()

        one       two     three
a -0.301848 -0.980870  1.136932
c  0.180950 -0.689600  1.932787
e  0.901335  0.507557 -0.637609
f -0.107288  0.248222 -0.867108
h  0.013985 -0.474336  1.603870

In [107]:
col =  pd.DataFrame({'one':[10,20,30,40,50,2000],
'two':[1000,0,30,40,50,60]})
col

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

In [108]:
col.replace({1000:10,2000:60})
col

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

In [109]:
col.replace({1000:10,2000:60})

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [110]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
ipl_data

{'Team': ['Riders',
  'Riders',
  'Devils',
  'Devils',
  'Kings',
  'kings',
  'Kings',
  'Kings',
  'Riders',
  'Royals',
  'Royals',
  'Riders'],
 'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
 'Year': [2014,
  2015,
  2014,
  2015,
  2014,
  2015,
  2016,
  2017,
  2016,
  2014,
  2015,
  2017],
 'Points': [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]}

In [111]:
fd = pd.DataFrame(ipl_data)
fd

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [114]:
fd.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [115]:
fd.groupby(['Team','Rank']).groups

{('Devils', 2): Int64Index([2], dtype='int64'),
 ('Devils', 3): Int64Index([3], dtype='int64'),
 ('Kings', 1): Int64Index([6, 7], dtype='int64'),
 ('Kings', 3): Int64Index([4], dtype='int64'),
 ('Riders', 1): Int64Index([0], dtype='int64'),
 ('Riders', 2): Int64Index([1, 8, 11], dtype='int64'),
 ('Royals', 1): Int64Index([10], dtype='int64'),
 ('Royals', 4): Int64Index([9], dtype='int64'),
 ('kings', 4): Int64Index([5], dtype='int64')}

In [121]:
tm = fd.groupby('Team').groups

In [123]:
tm = fd.groupby('Team')
for row,group in tm:
    print (row)
    print (group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [120]:
tm

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [124]:
tm.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788